Задание №1 (простое)
Напишите программу, которая проверяет, является ли введенная строка панграммой (т.е. содержит все буквы либо русского, либо английской алфавита)
Пример русской панграммы - Широкая электрификация южных губерний даст мощный толчок подъёму сельского хозяйства.
Пример английской - The quick brown fox jumps over the lazy dog
Расширенный вариант - выводится, каких букв алфавита не хватает во фразе

import string
count = 0
text = 'The quick brown fox jumps over the lazy do'
alphabet = 'abcdefghijklmnopqrstuvwxyz'
text = text.lower()
phraseletters = ''

for char in text:
    for letter in alphabet:
        if char == letter and char not in phraseletters:
            phraseletters += char

for char in phraseletters:
    for letter in alphabet:
        if char == letter:
            count += 1

if count == 26:
    print (text, '  - is pangram')
else:
    print (phraseletters , alphabet)