#Задание №1 (простое)
#Написать программу, которая будет задавать пользователю вопросы, и проверять правильность ответов.
#Если пользователь неправильно ответил на вопрос, то выводится сообщение, что ответ неверный и вопрос задается повторно.
#Программа должна задавать не менее трех вопросов.
#Вопросы задаются последовательно.

#Модифицировать программу из домашнего задания №1 так, чтобы:
#поддерживалось несколько вариантов верных ответов,
#вопросы и ответы лежали в словаре

import random
Countries = {
        'Ты знаешь столицу России ? ': {'Москва','Moscow'}, 
        'Ты знаешь столицу Испании ? ': {'Мадрид', 'Madrid'}, 
        'Ты знаешь столицу Австрии ? ': {'Вена','Vena'}
}
def rus():
    country = random.choice(list(Countries))
    while True:
        print (country)
        capital = input ()
        for i in Countries.values():
            if (capital in i) and (capital in Countries[country]):
                print('Ты молодец ')
                del Countries[country]
                return
        else:
            print('Ты ошибся, попробуй еще раз')



rus()
rus()
rus()