#Задание №1 (простое)
#Написать программу, которая будет задавать пользователю вопросы, и проверять правильность ответов.
#Если пользователь неправильно ответил на вопрос, то выводится сообщение, что ответ неверный и вопрос задается повторно.
#Программа должна задавать не менее трех вопросов.
#Вопросы задаются последовательно.

while True:
    a = input ('Ты знаешь столицу России ? ')
    if a in ['Москва', 'Moscow']:
        print ('Молодец')
        break
    else:
        print ('Неправильно, попробуй еще раз ')
while True:
    a = input ('Ты знаешь столицу Испании ? ')
    if a in ['Мадрид', 'Madrid']:
        print ('Молодец')
        break
    else:
        print ('Неправильно, попробуй еще раз ')
while True:
    a = input ('Ты знаешь столицу Австрии ? ')
    if a in ['Вена', 'Vienna']:
        print ('Молодец')
        break
    else:
        print ('Неправильно, попробуй еще раз ')